
export const useQuestions = () => {
const allQuestions = [
 {
    question: "คุณเปลี่ยนรหัสผ่านเป็นประจำ เช่น เปลี่ยนทุก ๆ 3 เดือน ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: `รหัสผ่านที่ดีควรมีการเปลี่ยนอยู่เป็นประจำ และการตั้งรหัสผ่านควรตั้งด้วยรูปแบบที่หาความเชื่อมโยงกับรหัสผ่านเดิมได้ยาก ความเห็นจากผู้เชี่ยวชาญ Mark Burnett เสริมว่า การเปลี่ยนรหัสผ่านเป็นประจำนั้น เป็นสิ่งจำเป็น แต่ความถี่ในการเปลี่ยนรหัสผ่านที่ดีคือทุก 6 เดือนหรือปีละครั้ง เพื่อให้ผู้ใช้ตั้งใจคิดรหัสผ่านอย่างรัดกุมและลดความสับสน`
  },
  {
    question: "รหัสผ่านของคุณมีความเรียบง่าย และใช้ข้อมูลส่วนตัว เช่น 1234 หรือวันเดือนปีเกิด หรือเบอร์โทรศัพท์ ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: `อ้างอิงจาก NIST (National Institute of Standards and Technology) ได้ให้คำแนะนำในการตั้งรหัสผ่าน คือ ควรตั้งรหัสผ่านในรูปแบบที่เรียกว่า “passphrase” ซึ่งมีความยาวไม่ต่ำกว่า 8 ตัวอักษร อาจเป็นประโยคหรือวลีสั้นๆ ที่ตนเองจำได้ เช่น “Hello@Bank+ImHere” ซึ่งอ่านเป็นประโยคได้ว่า “Hello Bank, I’m Here” และเป็นรหัสผ่านที่ผู้ใช้งานจำได้ไม่ยาก แถมมีความยาวถึง 17 ตัวอักษร ในทางคณิตศาสตร์พิสูจน์แล้วว่า รหัสผ่านที่ยาวจะยิ่งใช้เวลามากขึ้นในการแฮ็กอย่างมีนัยสำคัญ`
  },
  {
    question: "ระหว่างที่คุณกดรหัสผ่าน ไม่จำเป็นต้องระวังคนแอบดูรหัสผ่านที่คุณกำลังกด ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: `เราจำเป็นต้องระวังคนแอบดูรหัสผ่านขณะที่กำลังกดอยู่เสมอ เช่น การแอบมองจากข้างหลัง หรือหากมีกล้องอยู่บริเวณนั้นที่อาจจะเห็นตำแหน่งที่กดรหัสบนหน้าจอหรือคีย์บอร์ด เป็นต้น ซึ่งควรจะเอามือบังหรือหันในมุมที่จะไม่สามารถเห็นรหัสขณะกดได้`
  },
  {
    question: "หมั่นตรวจสอบรายการธุรกรรมทางการเงินของคุณเป็นประจำ เพื่อให้แน่ใจว่าไม่มีการทำรายการอื่นที่ไม่ได้รับอนุญาต ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: `ควรหมั่นตรวจสอบรายการธุรกรรมทางการเงินเป็นประจำ หากพบรายการที่น่าสงสัยให้ติดต่อสอบถามธนาคารโดยเร็ว`
  },
 {
    question: "ควรบันทึกรหัสผ่านไว้ในโทรศัพท์ เพื่อความสะดวกในการใช้งาน ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรบันทึกรหัสผ่านไว้ในโทรศัพท์ หรือเขียนแปะไว้ที่ใด ๆ"
  },
  {
    question: "หากคนในครอบครัวหรือคนสนิทของคุณต้องการทราบรหัสผ่าน คุณจะส่งรหัสผ่านไปให้ด้วยช่องทางการแชท ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "การส่งรหัสผ่านให้กับครอบครัวหรือคนสนิทผ่านช่องทางแชท เป็นการกระทำที่ไม่ปลอดภัย เนื่องจากผู้โจมตีสามารถใช้เทคนิคชื่อว่า Man-In-The-Middle ดักจับข้อมูลที่ส่งระหว่างผู้ใช้งานกับผู้รับได้"
  },
  {
    question: "คุณให้รหัสผ่านกับคนที่ไว้ใจ เพื่อใช้ในการทำธุรกรรมทางการเงิน ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "แม้ว่าตามหลักการไม่ควรให้รหัสผ่านกับคนที่ไว้ใจ แต่ละบุคคลอาจจะประเมินความเสี่ยงแตกต่างกันไป และควรมีการจัดการความเสี่ยง เช่น เปลี่ยนรหัสผ่านหลังจากทำธุรกรรม"
  },
  {
    question: "ในขณะที่มีปัญหาในการทำธุรกรรมทางการเงิน คุณบอกรหัสผ่านให้กับเจ้าหน้าที่หรือผู้อื่นที่ให้ความช่วยเหลือคุณ ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรบอกให้เจ้าหน้าที่หรือผู้ใด ๆ เนื่องจากเจ้าหน้าที่ธนาคารจะไม่มีมาตรการในการถามรหัสผ่านจากผู้ใช้งาน"
  },
  {
    question: "ก่อนการติดตั้งแอปพลิเคชัน คุณได้อ่านการขอสิทธิ์เข้าถึงข้อมูลและความเป็นส่วนตัวอย่างละเอียด ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "ควรอ่านการขอสิทธิ์การเข้าถึงข้อมูลและความเป็นส่วนตัวอย่างละเอียด หากไม่แน่ใจควรสอบถามผู้รู้หรือธนาคาร"
  },
  {
    question: "คุณเชื่อมต่อ Wi-Fi สาธารณะ หรือ Wi-Fi ที่คุณไม่รู้จักเป็นประจำ ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรเชื่อมต่อ Wi-Fi สาธารณะหรือไม่รู้จัก โดยเฉพาะในที่สาธารณะซึ่งมีความเสี่ยงในการถูกดักข้อมูลจาก WiFi Access Point ปลอม"
  },
  {
    question: "ควรจะลงแอปพลิเคชันจาก Link ที่ผู้อื่นส่งมาให้ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรติดตั้งแอปพลิเคชันจากลิงก์ที่ผู้อื่นส่งมา เนื่องจากอาจได้รับแอปพลิเคชันปลอมหรือมัลแวร์"
  },
  {
    question: "ควรจะลงแอปพลิเคชันด้วยการพิมพ์ชื่อแอปพลิเคชันบน store เช่น AppStore หรือ Google Play Store ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "ควรดาวน์โหลดจาก Official store เช่น AppStore หรือ Google Play Store ที่มีการตรวจสอบความปลอดภัยของแอปก่อนเผยแพร่"
  }, {
    question: "ไม่ควรให้ข้อมูลส่วนบุคคลกับคนแปลกหน้าใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "หากมีคนแปลกหน้าถามข้อมูลส่วนตัว ควรพิจารณาให้ดีก่อนว่าทำไมเราจึงต้องให้ข้อมูลนั้นกับบุคคลแปลกหน้านั้น"
  },
  {
    question: "เมื่อได้ URL ทางอีเมลหรือ SMS ให้ Click โดยไม่ลังเล ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ต้องตรวจสอบก่อนทุกครั้ง ธนาคารไม่มีนโยบายแนบลิงก์ไปทางอีเมลหรือ SMS เพื่อขอข้อมูลส่วนบุคคล"
  },
  {
    question: "ควรล็อคหน้าจอโทรศัพท์เสมอเมื่อไม่ได้ใช้งาน ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "เพื่อป้องกันเบื้องต้น หากถูกขโมยโทรศัพท์ไป ผู้อื่นจะไม่สามารถเข้าถึงโทรศัพท์ของคุณได้"
  },
  {
    question: "การใช้งานเว็บไซต์ทางการเงิน ควรจะสังเกตว่า URL จะขึ้นต้นด้วยการใช้ https: ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "และควรสังเกตในส่วนอื่น ๆ ด้วย เช่น ชื่อโดเมนตรงกับเว็บไซต์ที่เราต้องการเข้าหรือไม่"
  },
  {
    question: "ควรอัปเดตซอฟต์แวร์ของโทรศัพท์มือถือเป็นประจำใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "เนื่องจากทุกครั้งที่มีการออกให้อัปเดตจะเป็นการเพิ่มฟีเจอร์และความปลอดภัยเพิ่มเติม"
  },
  {
    question: "หากได้รับข้อมูลส่วนบุคคลของผู้อื่น ควรจะต้องดูแลข้อมูลส่วนบุคคลของผู้อื่นให้ดีเท่าข้อมูลของคุณเอง ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "เพื่อช่วยป้องกันความเสียหายจากการนำเอาข้อมูลส่วนบุคคลนั้นไปใช้ในทางที่จะสร้างผลกระทบกับเจ้าของข้อมูล และยังเป็นการเคารพสิทธิขั้นพื้นฐานของเจ้าของข้อมูลส่วนบุคคลตามรัฐธรรมนูญและมาตรฐานสากล"
  },
  {
    question: "สามารถเปิดจอคอมพิวเตอร์ค้างไว้เมื่อไม่อยู่หน้าเครื่องเพื่อกลับมาใช้งานต่อได้รวดเร็ว ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรเปิดหน้าจอค้างไว้เพราะอาจจะมีมิจฉาชีพหรือคนใกล้ชิดเข้ามาดูข้อมูลในเครื่องของคุณได้ ควรล็อกหน้าจอทุกครั้ง"
  },
  {
    question: "เมื่อได้รับโทรศัพท์จากคนไม่รู้จักหรือไม่คาดว่าจะได้รับโทรศัพท์นั้น คุณสามารถทำตามคำบอกได้ทุกอย่าง ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรทำตามคำบอกจากคนไม่รู้จัก หากมีความจำเป็นในการให้ข้อมูล ควรสอบถามและพิจารณาให้ดีว่าเป็นหน่วยงานนั้นจริงก่อนที่จะให้ข้อมูล"
  }, {
    question: "หากได้รับแจ้งว่าท่านได้รับรางวัล ควรดีใจอย่างที่สุดและทำตามคำบอกทุกประการ ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "การพิจารณาทำตามคำบอกในแต่ละอย่างว่าจำเป็นต้องทำหรือไม่ ให้พิจารณาทุกครั้งว่าเป็นหน่วยงานนั้นจริง โดยเฉพาะการขอให้ติดตั้งแอปพลิเคชันหรือ LINE ที่ใช้ในการสื่อสาร ควรตรวจสอบความถูกต้องและความน่าเชื่อถือของรางวัลจากช่องทางอื่น เช่น เว็บไซต์ทางการของหน่วยงาน เช่น การบินไทย มิฉะนั้นอาจถูกหลอกให้โอนเงินค่าธรรมเนียมโดยไม่ได้รับรางวัลจริง"
  },
  {
    question: "เมื่อพบเห็น USB thumb drive หล่น คุณควรจะรีบเอามาเสียบเครื่องคอมพิวเตอร์ของคุณทันทีเพื่อดูว่ามีข้อมูลสำคัญอะไรอยู่บ้าง ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ควรนำมาเสียบเครื่องคอมพิวเตอร์ของคุณ เพราะอาจจะมีมัลแวร์ฝังอยู่ ทำให้ระบบถูกโจมตีหรือล้วงข้อมูลได้"
  },
  {
    question: "URL นี้ https://gooogle.com เป็น URL ของกูเกิ้ลจริงหรือไม่",
    options: ["จริง", "ไม่จริง"],
    correctAnswerIndex: 1,
    explanation: "ไม่จริง เนื่องจาก Google มีตัว o แค่ 2 ตัว ส่วน gooogle.com มีตัว o 3 ตัว เป็น URL ปลอมที่อาจใช้หลอกลวงหรือโจมตี"
  },
  {
    question: "ควรจะสำรองข้อมูลสำคัญอย่างสม่ำเสมอ ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 0,
    explanation: "ใช่ โดยความถี่ในการสำรองข้อมูลนั้นจะขึ้นกับความสำคัญของระบบงาน เพื่อป้องกันความเสี่ยงที่ข้อมูลจะสูญหาย"
  },
  {
    question: "เมื่อท่านจะเข้าเว็บไซต์ของธนาคารเพื่อทำธุรกรรมทางการเงิน ควร search หาเว็บไซต์ของธนาคารจาก Google ใช่หรือไม่",
    options: ["ใช่", "ไม่ใช่"],
    correctAnswerIndex: 1,
    explanation: "ไม่ใช่ เพราะอาจเจอโฆษณาหรือลิงก์ฟิชชิงที่มิจฉาชีพซื้อไว้ ผู้ใช้งานควรพิมพ์ URL ด้วยตนเอง หรืออ้างอิงจากแหล่งทางการของธนาคาร"
  }
]

  function getRandomQuestions(count: number) {
    const shuffled = allQuestions.slice().sort(() => Math.random() - 0.5)
    return shuffled.slice(0, count)
  }

  return {
    allQuestions,
    getRandomQuestions
  }
}
