<template>
  <MuiPage>
    <MuiHeader title="ข้อกำหนด" />
    <MuiCard>
      <BizShareSessionTitle label="เงื่อนไขการให้บริการ" />
      <!-- <BizShareText
        text="เงื่อนไขการให้บริการนี้เป็นข้อตกลงระหว่าง บริษัท mana 2018จํากัด ซึ่งต่อไปนี้จะเรียกว่า “บริษัท” ฝ่ายหนึ่ง กับ “ผู้ใช้ บริการ” อีกฝ่ายหนึ่ง เพื่อใช้บริการแอพพลิเคชั่น mana ซึ่งต่อ ไปนี้จะเรียกว่า “บริการ” โดยผู้ใช้ บริการสามารถทําธุรกรรม การเงิน เติม-จ่าย-โอน-ถอน ได้อย่างสะดวกจากโทรศัพท์ เคลื่อนที่ ตามรายละเอียดที่ปรากฏในเงื่อนไขการให้บริการแอพ พลิเคชั่น mana ซึ่งต่อไปนี้จะเรียกว่า “เงื่อนไขการให้บริการ” โดยเงื่อนไขการให้บริการนี้อาจมีลักษณะกระทบสิทธิของผู้ใช้ บริการ ซึ่งผู้ใช้บริการควรอ่านและทําความเข้าใจอย่างละเอียด และหากมีข้อสงสัยเกี่ยวกับบริการของบริษัทผู้ใช้บริการสามารถ ติดต่อสอบถามได้โดยทันที" />
      <BizShareSessionTitle label="1. ข้อกําหนดทั่วไป" />
      <BizShareText text="
      1.1 ผู้ใช้บริการตกลงที่จะปฏิบัติและผูกพันตามเงื่อนไขการใช้ บริการ ซึ่งการใช้บริการของผู้ใช้บริการถือเป็นการยอมรับ
      เงื่อนไขการให้บริการนี้ โดยบริษัทอาจแก้ไขหรือเพิ่มเติม
      เงื่อนไขการให้บริการได้ไม่ว่าในเวลาใดโดยไม่ต้องแจ้งให้ผู้ใช้ บริการทราบล่วงหน้า
      และการที่ผู้ใช้บริการใช้บริการต่อไป ภายหลังจากที่มีการแก้ไขหรือเพิ่มเติมดังกล่าว ย่อมถือเป็น
      การยอมรับการแก้ไขในแต่ละครั้ง" />
      <BizShareText text="1.2 เว้นแต่จะได้มีการแจ้ง หรือกําหนดไว้เป็นอย่างอื่น คุณลักษณะ ใหม่ๆ ที่ได้เพิ่มเติม ปรับปรุง
      หรือแก้ไขในบริการให้ถือว่าอยู่ ภายใต้เงื่อนไขการให้บริการฉบับนี้ทั้งสิ้น " />
      <BizShareText
        text="1.3 บริษัทสงวนสิทธิ์ในการปรับปรุงหรือยกเลิกการบริการ หรือ ส่วนใดส่วนหนึ่งของบริการ ไม่ว่าจะเป็นการชั่วครา" /> -->

      <BizShareText :text="data.textTH" v-html="data?.textTH" />
    </MuiCard>
  </MuiPage>
</template>


<script lang="ts" setup>
import { getManaContext } from "@manaapp/ui";

const manaLib = await getManaContext()
const nexumStore = useNexumStore();
const { getData } = nexumStore;
const { data, pending } = storeToRefs(nexumStore);

getData('get-nexum-consent-shopPolicy').then(async () => {
});
</script>